backend/app/models/post.rb

  def self.all_with_comments
    self.all.map do |post|
---
SELECT "posts".* FROM "posts"