backend/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    all = Comment.all

INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["content", "asdf"], ["created_at", "2019-07-28 20:09:43.551675"], ["updated_at", "2019-07-28 20:09:43.551675"]]
---
  def create
    comment = Comment.create(allow_params)