backend/app/controllers/posts_controller.rb

INSERT INTO "posts" ("posted", "title", "description", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    post = Post.create(allow_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 48]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 35]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 8]]
---
  def destroy
    post = Post.find(params[:id])
    post.comments.each {|comment| comment.destroy }
    post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "996 Harley Davidson Wide Glide EVO - $4500 "], ["updated_at", "2019-07-29 16:57:43.845991"], ["id", 18]]
---
  def update
    post = Post.find(params[:id])
    post.title = params[:title]
    post.description = params[:description]
    post.image = params[:image]
    post.save